---
title: AppearanceAssetElement
classe: Autodesk.Revit.DB.AppearanceAssetElement
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# AppearanceAssetElement

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `AppearanceAssetElement Create(Document, String, Asset)` | `AppearanceAssetElement.Create(document, name, asset)` | AppearanceAssetElement |
| `AppearanceAssetElement Duplicate(String)` | `appearanceAssetElement.Duplicate(name)` | AppearanceAssetElement |
| `AppearanceAssetElement GetAppearanceAssetElementByName(Document, String)` | `AppearanceAssetElement.GetAppearanceAssetElementByName(doc, name)` | AppearanceAssetElement |
| `Asset GetRenderingAsset()` | `appearanceAssetElement.GetRenderingAsset()` | Asset |
| `Void SetRenderingAsset(Asset)` | `appearanceAssetElement.SetRenderingAsset(asset)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```